---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BoundaryNoOverlap
source: html/01fff6e2-32da-1baf-f1e1-c1e6e49ddc07.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BoundaryNoOverlap Property

The split sketch is out of the boundary of split element sketch..

## Syntax (C#)
```csharp
public static FailureDefinitionId BoundaryNoOverlap { get; }
```